{"type": 1, "style": [{"key": "margin-bottom", "value": "20px"}], "data": [{"block_title": "Vision and Mission-1", "type": 2, "style": {"main": {"class": "", "other": ""}, "title": {"class": "title-n", "other": ""}, "content": {"class": "content-n", "other": ""}, "value": {"class": "", "other": ""}}, "title": "Vision and Mission", "content": [{"type": 1, "title": "", "content": "    The most important goal of SingleWell is to pursue the economic performance of enterprises. However, in pursuit of economic performance, we are committed to integrating social justice, responsibility and environmental protection into our important business strategies, making corporate social responsibility a part of our daily operation activities, and making every effort to promote and contribute to environmental protection such as corporate social responsibility, energy conservation and greening.", "style": {"main": {"class": "", "other": ""}, "title": {"class": "", "other": ""}, "content": {"class": "", "other": "width: 100%;"}, "value": {"class": "", "other": ""}}, "value": ""}, {"type": 1, "title": "", "content": "    In 2009, the United Nations Environment Programme (UNEP) proposed the concept of \"Global Green New Deal\", calling on global leaders to invest in environmental programs that can create more job opportunities, so as to restore the natural ecosystem that supports the global economy, and solve climate problems. The crisis of change is expected to make the world “shift from mining the earth to managing and reinvesting the earth”.", "style": {"main": {"class": "", "other": ""}, "title": {"class": "", "other": ""}, "content": {"class": "", "other": "width: 100%;"}, "value": {"class": "", "other": ""}}, "value": ""}, {"type": 1, "title": "", "content": "    SingleWell has been investing in the energy-saving and greening industry since 2014. It hopes to coordinate the relationship between human beings and the environment and ensure the sustainable development of the economy and society from the perspective of environmental protection. Clean energy, rely on scientific and technological progress, and promote environmental protection.", "style": {"main": {"class": "", "other": ""}, "title": {"class": "", "other": ""}, "content": {"class": "", "other": "width: 100%;"}, "value": {"class": "", "other": ""}}, "value": ""}], "value": ""}]}